results/run008/system/functionObjects/holdUp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class dictionary;
  object functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

holdUp {
  type volFieldValue;
  libs ("libfieldFunctionObjects.so");

  log true;
  writeControl runTime;
  writeInterval 0.05;
  writeFields false;

  regionType all;
  operation volAverage;

  fields (alpha.air);
}
