results/run008/system/functionObjects/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../input"

surfaces
{
    type            	surfaces;
    functionObjectLibs 	("libfieldFunctionObjects.so");
    enabled         	true;
    writeControl    	runTime;
    writeInterval		$endT;
    timeStart           $inizioMedia;
    

	interpolationScheme cell;
	surfaceFormat 		raw;

	surfaces
	(
	        y_8cm
		    {
	    		type            	plane;
	    		planeType       	pointAndNormal;
	    		pointAndNormalDict
	    		{
	        		basePoint       (0 0.08 0);
	        		normalVector    (0 1 0);
	    		}
	    		interpolate         false;
	    		triangulate         false;
		    }	
		    
		 y_63cm
		    {
	    		type            	plane;
	    		planeType       	pointAndNormal;
	    		pointAndNormalDict
	    		{
	        		basePoint       (0 0.63 0);
	        		normalVector    (0 1 0);
	    		}
	    		interpolate         false;
	    		triangulate         false;
		    }	
    );

	fields
	(   
		UMean.air
		UMean.water
		alphaMean.air
		alphaMean.water
		pMean
	);

}

